def on_one_line(p1, p2, p3): # p1 - первая точка, p2 - вторая, p3 - третья
    x1, y1 = p1 # координаты точки
    x2, y2 = p2 # координаты точки
    x3, y3 = p3 # координаты точки
    # Вычисляем коэффициент k и сдвиг b
    k = (y2 - y1) / (x2 - x1) # коэффициент
    b = y1 - k * x1 # сдвиг
   
    return y3 == k * x3 + b  # Проверяем, лежит ли p3 на этой прямой


print(on_one_line((1, 1), (2, 2), (3, 3)))
print(on_one_line((1, 1), (2, 2), (3, 4)))
print(on_one_line((1, 2), (2, 2), (3, 2)))







